In [2]:
import pandas as pd
import seaborn as sns

from sklearn.model_selection import train_test_splitdf.isnull().sum()

from scipy import stats

from sklearn.metrics import accuracy_score, confusion_matrix
from sklearn import linear_model,tree,ensemble,neural_network

In [3]:
df = pd.read_csv("/Users/shanelim/Desktop/Sem 3.1/BC3409/Homework/Homework 2 - Decision Tree/Loan Default II (Employed).csv")

In [4]:
df.isnull().sum()

Index            0
Employed         0
Bank Balance     0
Annual Salary    0
Defaulted?       0
dtype: int64

In [5]:
df.head()

   Index  Employed  Bank Balance  Annual Salary  Defaulted?
0      1         1       8754.36      532339.56           0
1      2         0       9806.16      145273.56           0
2      3         1      12882.60      381205.68           0
3      4         1       6351.00      428453.88           0
4      5         1       9427.92      461562.00           0

In [6]:
df = pd.get_dummies(df, columns=[ "Employed","Defaulted?"])

In [7]:
df

,Index,Bank Balance,Annual Salary,Employed_0,Employed_1,Defaulted?_0,Defaulted?_1
0,1,8754.36,532339.56,False,True,True,False
1,2,9806.16,145273.56,True,False,True,False
2,3,12882.60,381205.68,False,True,True,False
3,4,6351.00,428453.88,False,True,True,False
4,5,9427.92,461562.00,False,True,True,False
...,...,...,...,...,...,...,...
9995,9996,8538.72,635908.56,False,True,True,False
9996,9997,9095.52,235928.64,False,True,True,False
9997,9998,10144.92,703633.92,False,True,True,False
9998,9999,18828.12,440029.32,False,True,True,False
9999,10000,2411.04,202355.40,True,False,True,False

In [10]:
X = df.drop("Index", axis=1)
Y = df["Index"]
X_train, X_test, Y_train, Y_test = train_test_split(X,Y)

In [ ]:
X_train["Credit Amount"] = stats.zscore(X_train["Credit Amount"])
X_test["Credit Amount"] = stats.zscore(X_test["Credit Amount"])